Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/include/component/usart.h
/* LIN mode */
#define US_IER_LIN_RXRDY_Pos                  _U_(0)                                               /**< (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_LIN_RXRDY_Msk                  (_U_(0x1) << US_IER_LIN_RXRDY_Pos)                   /**< (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_LIN_RXRDY(value)               (US_IER_LIN_RXRDY_Msk & ((value) << US_IER_LIN_RXRDY_Pos))
#define US_IER_LIN_TXRDY_Pos                  _U_(1)                                               /**< (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_LIN_TXRDY_Msk                  (_U_(0x1) << US_IER_LIN_TXRDY_Pos)                   /**< (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_LIN_TXRDY(value)               (US_IER_LIN_TXRDY_Msk & ((value) << US_IER_LIN_TXRDY_Pos))
#define US_IER_LIN_OVRE_Pos                   _U_(5)                                               /**< (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_LIN_OVRE_Msk                   (_U_(0x1) << US_IER_LIN_OVRE_Pos)                    /**< (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_LIN_OVRE(value)                (US_IER_LIN_OVRE_Msk & ((value) << US_IER_LIN_OVRE_Pos))
#define US_IER_LIN_FRAME_Pos                  _U_(6)                                               /**< (US_IER) Framing Error Interrupt Enable Position */
#define US_IER_LIN_FRAME_Msk                  (_U_(0x1) << US_IER_LIN_FRAME_Pos)                   /**< (US_IER) Framing Error Interrupt Enable Mask */
#define US_IER_LIN_FRAME(value)               (US_IER_LIN_FRAME_Msk & ((value) << US_IER_LIN_FRAME_Pos))
#define US_IER_LIN_PARE_Pos                   _U_(7)                                               /**< (US_IER) Parity Error Interrupt Enable Position */
#define US_IER_LIN_PARE_Msk                   (_U_(0x1) << US_IER_LIN_PARE_Pos)                    /**< (US_IER) Parity Error Interrupt Enable Mask */
#define US_IER_LIN_PARE(value)                (US_IER_LIN_PARE_Msk & ((value) << US_IER_LIN_PARE_Pos))
#define US_IER_LIN_TIMEOUT_Pos                _U_(8)                                               /**< (US_IER) Timeout Interrupt Enable Position */
#define US_IER_LIN_TIMEOUT_Msk                (_U_(0x1) << US_IER_LIN_TIMEOUT_Pos)                 /**< (US_IER) Timeout Interrupt Enable Mask */
#define US_IER_LIN_TIMEOUT(value)             (US_IER_LIN_TIMEOUT_Msk & ((value) << US_IER_LIN_TIMEOUT_Pos))
#define US_IER_LIN_TXEMPTY_Pos                _U_(9)                                               /**< (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_LIN_TXEMPTY_Msk                (_U_(0x1) << US_IER_LIN_TXEMPTY_Pos)                 /**< (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_LIN_TXEMPTY(value)             (US_IER_LIN_TXEMPTY_Msk & ((value) << US_IER_LIN_TXEMPTY_Pos))
#define US_IER_LIN_LINBK_Pos                  _U_(13)                                              /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Position */
#define US_IER_LIN_LINBK_Msk                  (_U_(0x1) << US_IER_LIN_LINBK_Pos)                   /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Mask */
#define US_IER_LIN_LINBK(value)               (US_IER_LIN_LINBK_Msk & ((value) << US_IER_LIN_LINBK_Pos))
#define US_IER_LIN_LINID_Pos                  _U_(14)                                              /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Position */
#define US_IER_LIN_LINID_Msk                  (_U_(0x1) << US_IER_LIN_LINID_Pos)                   /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Mask */
#define US_IER_LIN_LINID(value)               (US_IER_LIN_LINID_Msk & ((value) << US_IER_LIN_LINID_Pos))
#define US_IER_LIN_LINTC_Pos                  _U_(15)                                              /**< (US_IER) LIN Transfer Completed Interrupt Enable Position */
#define US_IER_LIN_LINTC_Msk                  (_U_(0x1) << US_IER_LIN_LINTC_Pos)                   /**< (US_IER) LIN Transfer Completed Interrupt Enable Mask */
#define US_IER_LIN_LINTC(value)               (US_IER_LIN_LINTC_Msk & ((value) << US_IER_LIN_LINTC_Pos))
#define US_IER_LIN_LINBE_Pos                  _U_(25)                                              /**< (US_IER) LIN Bus Error Interrupt Enable Position */
#define US_IER_LIN_LINBE_Msk                  (_U_(0x1) << US_IER_LIN_LINBE_Pos)                   /**< (US_IER) LIN Bus Error Interrupt Enable Mask */
#define US_IER_LIN_LINBE(value)               (US_IER_LIN_LINBE_Msk & ((value) << US_IER_LIN_LINBE_Pos))
#define US_IER_LIN_LINISFE_Pos                _U_(26)                                              /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Position */
#define US_IER_LIN_LINISFE_Msk                (_U_(0x1) << US_IER_LIN_LINISFE_Pos)                 /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Mask */
#define US_IER_LIN_LINISFE(value)             (US_IER_LIN_LINISFE_Msk & ((value) << US_IER_LIN_LINISFE_Pos))
#define US_IER_LIN_LINIPE_Pos                 _U_(27)                                              /**< (US_IER) LIN Identifier Parity Interrupt Enable Position */
#define US_IER_LIN_LINIPE_Msk                 (_U_(0x1) << US_IER_LIN_LINIPE_Pos)                  /**< (US_IER) LIN Identifier Parity Interrupt Enable Mask */
#define US_IER_LIN_LINIPE(value)              (US_IER_LIN_LINIPE_Msk & ((value) << US_IER_LIN_LINIPE_Pos))
#define US_IER_LIN_LINCE_Pos                  _U_(28)                                              /**< (US_IER) LIN Checksum Error Interrupt Enable Position */
#define US_IER_LIN_LINCE_Msk                  (_U_(0x1) << US_IER_LIN_LINCE_Pos)                   /**< (US_IER) LIN Checksum Error Interrupt Enable Mask */
#define US_IER_LIN_LINCE(value)               (US_IER_LIN_LINCE_Msk & ((value) << US_IER_LIN_LINCE_Pos))
#define US_IER_LIN_LINSNRE_Pos                _U_(29)                                              /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Position */
#define US_IER_LIN_LINSNRE_Msk                (_U_(0x1) << US_IER_LIN_LINSNRE_Pos)                 /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Mask */
#define US_IER_LIN_LINSNRE(value)             (US_IER_LIN_LINSNRE_Msk & ((value) << US_IER_LIN_LINSNRE_Pos))
#define US_IER_LIN_LINSTE_Pos                 _U_(30)                                              /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Position */
#define US_IER_LIN_LINSTE_Msk                 (_U_(0x1) << US_IER_LIN_LINSTE_Pos)                  /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Mask */
#define US_IER_LIN_LINSTE(value)              (US_IER_LIN_LINSTE_Msk & ((value) << US_IER_LIN_LINSTE_Pos))
#define US_IER_LIN_LINHTE_Pos                 _U_(31)                                              /**< (US_IER) LIN Header Timeout Error Interrupt Enable Position */
#define US_IER_LIN_LINHTE_Msk                 (_U_(0x1) << US_IER_LIN_LINHTE_Pos)                  /**< (US_IER) LIN Header Timeout Error Interrupt Enable Mask */
#define US_IER_LIN_LINHTE(value)              (US_IER_LIN_LINHTE_Msk & ((value) << US_IER_LIN_LINHTE_Pos))
#define US_IER_LIN_Msk                        _U_(0xFE00E3E3)                                       /**< (US_IER_LIN) Register Mask  */

/* LON mode */
#define US_IER_LON_RXRDY_Pos                  _U_(0)                                               /**< (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_LON_RXRDY_Msk                  (_U_(0x1) << US_IER_LON_RXRDY_Pos)                   /**< (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_LON_RXRDY(value)               (US_IER_LON_RXRDY_Msk & ((value) << US_IER_LON_RXRDY_Pos))
#define US_IER_LON_TXRDY_Pos                  _U_(1)                                               /**< (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_LON_TXRDY_Msk                  (_U_(0x1) << US_IER_LON_TXRDY_Pos)                   /**< (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_LON_TXRDY(value)               (US_IER_LON_TXRDY_Msk & ((value) << US_IER_LON_TXRDY_Pos))
#define US_IER_LON_OVRE_Pos                   _U_(5)                                               /**< (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_LON_OVRE_Msk                   (_U_(0x1) << US_IER_LON_OVRE_Pos)                    /**< (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_LON_OVRE(value)                (US_IER_LON_OVRE_Msk & ((value) << US_IER_LON_OVRE_Pos))
#define US_IER_LON_LSFE_Pos                   _U_(6)                                               /**< (US_IER) LON Short Frame Error Interrupt Enable Position */
#define US_IER_LON_LSFE_Msk                   (_U_(0x1) << US_IER_LON_LSFE_Pos)                    /**< (US_IER) LON Short Frame Error Interrupt Enable Mask */
#define US_IER_LON_LSFE(value)                (US_IER_LON_LSFE_Msk & ((value) << US_IER_LON_LSFE_Pos))
#define US_IER_LON_LCRCE_Pos                  _U_(7)                                               /**< (US_IER) LON CRC Error Interrupt Enable Position */
#define US_IER_LON_LCRCE_Msk                  (_U_(0x1) << US_IER_LON_LCRCE_Pos)                   /**< (US_IER) LON CRC Error Interrupt Enable Mask */
#define US_IER_LON_LCRCE(value)               (US_IER_LON_LCRCE_Msk & ((value) << US_IER_LON_LCRCE_Pos))
#define US_IER_LON_TXEMPTY_Pos                _U_(9)                                               /**< (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_LON_TXEMPTY_Msk                (_U_(0x1) << US_IER_LON_TXEMPTY_Pos)                 /**< (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_LON_TXEMPTY(value)             (US_IER_LON_TXEMPTY_Msk & ((value) << US_IER_LON_TXEMPTY_Pos))
#define US_IER_LON_UNRE_Pos                   _U_(10)                                              /**< (US_IER) Underrun Error Interrupt Enable Position */
#define US_IER_LON_UNRE_Msk                   (_U_(0x1) << US_IER_LON_UNRE_Pos)                    /**< (US_IER) Underrun Error Interrupt Enable Mask */
#define US_IER_LON_UNRE(value)                (US_IER_LON_UNRE_Msk & ((value) << US_IER_LON_UNRE_Pos))
#define US_IER_LON_LTXD_Pos                   _U_(24)                                              /**< (US_IER) LON Transmission Done Interrupt Enable Position */
#define US_IER_LON_LTXD_Msk                   (_U_(0x1) << US_IER_LON_LTXD_Pos)                    /**< (US_IER) LON Transmission Done Interrupt Enable Mask */
#define US_IER_LON_LTXD(value)                (US_IER_LON_LTXD_Msk & ((value) << US_IER_LON_LTXD_Pos))
#define US_IER_LON_LCOL_Pos                   _U_(25)                                              /**< (US_IER) LON Collision Interrupt Enable Position */
#define US_IER_LON_LCOL_Msk                   (_U_(0x1) << US_IER_LON_LCOL_Pos)                    /**< (US_IER) LON Collision Interrupt Enable Mask */
#define US_IER_LON_LCOL(value)                (US_IER_LON_LCOL_Msk & ((value) << US_IER_LON_LCOL_Pos))
#define US_IER_LON_LFET_Pos                   _U_(26)                                              /**< (US_IER) LON Frame Early Termination Interrupt Enable Position */
#define US_IER_LON_LFET_Msk                   (_U_(0x1) << US_IER_LON_LFET_Pos)                    /**< (US_IER) LON Frame Early Termination Interrupt Enable Mask */
#define US_IER_LON_LFET(value)                (US_IER_LON_LFET_Msk & ((value) << US_IER_LON_LFET_Pos))
#define US_IER_LON_LRXD_Pos                   _U_(27)                                              /**< (US_IER) LON Reception Done Interrupt Enable Position */
#define US_IER_LON_LRXD_Msk                   (_U_(0x1) << US_IER_LON_LRXD_Pos)                    /**< (US_IER) LON Reception Done Interrupt Enable Mask */
#define US_IER_LON_LRXD(value)                (US_IER_LON_LRXD_Msk & ((value) << US_IER_LON_LRXD_Pos))
#define US_IER_LON_LBLOVFE_Pos                _U_(28)                                              /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Position */
#define US_IER_LON_LBLOVFE_Msk                (_U_(0x1) << US_IER_LON_LBLOVFE_Pos)                 /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Mask */
#define US_IER_LON_LBLOVFE(value)             (US_IER_LON_LBLOVFE_Msk & ((value) << US_IER_LON_LBLOVFE_Pos))
#define US_IER_LON_Msk                        _U_(0x1F0006E3)                                       /**< (US_IER_LON) Register Mask  */


