Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/include/component/usart.h
/* LIN mode */
#define US_IDR_LIN_RXRDY_Pos                  _U_(0)                                               /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_LIN_RXRDY_Msk                  (_U_(0x1) << US_IDR_LIN_RXRDY_Pos)                   /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_LIN_RXRDY(value)               (US_IDR_LIN_RXRDY_Msk & ((value) << US_IDR_LIN_RXRDY_Pos))
#define US_IDR_LIN_TXRDY_Pos                  _U_(1)                                               /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_LIN_TXRDY_Msk                  (_U_(0x1) << US_IDR_LIN_TXRDY_Pos)                   /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_LIN_TXRDY(value)               (US_IDR_LIN_TXRDY_Msk & ((value) << US_IDR_LIN_TXRDY_Pos))
#define US_IDR_LIN_OVRE_Pos                   _U_(5)                                               /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_LIN_OVRE_Msk                   (_U_(0x1) << US_IDR_LIN_OVRE_Pos)                    /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_LIN_OVRE(value)                (US_IDR_LIN_OVRE_Msk & ((value) << US_IDR_LIN_OVRE_Pos))
#define US_IDR_LIN_FRAME_Pos                  _U_(6)                                               /**< (US_IDR) Framing Error Interrupt Disable Position */
#define US_IDR_LIN_FRAME_Msk                  (_U_(0x1) << US_IDR_LIN_FRAME_Pos)                   /**< (US_IDR) Framing Error Interrupt Disable Mask */
#define US_IDR_LIN_FRAME(value)               (US_IDR_LIN_FRAME_Msk & ((value) << US_IDR_LIN_FRAME_Pos))
#define US_IDR_LIN_PARE_Pos                   _U_(7)                                               /**< (US_IDR) Parity Error Interrupt Disable Position */
#define US_IDR_LIN_PARE_Msk                   (_U_(0x1) << US_IDR_LIN_PARE_Pos)                    /**< (US_IDR) Parity Error Interrupt Disable Mask */
#define US_IDR_LIN_PARE(value)                (US_IDR_LIN_PARE_Msk & ((value) << US_IDR_LIN_PARE_Pos))
#define US_IDR_LIN_TIMEOUT_Pos                _U_(8)                                               /**< (US_IDR) Timeout Interrupt Disable Position */
#define US_IDR_LIN_TIMEOUT_Msk                (_U_(0x1) << US_IDR_LIN_TIMEOUT_Pos)                 /**< (US_IDR) Timeout Interrupt Disable Mask */
#define US_IDR_LIN_TIMEOUT(value)             (US_IDR_LIN_TIMEOUT_Msk & ((value) << US_IDR_LIN_TIMEOUT_Pos))
#define US_IDR_LIN_TXEMPTY_Pos                _U_(9)                                               /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_LIN_TXEMPTY_Msk                (_U_(0x1) << US_IDR_LIN_TXEMPTY_Pos)                 /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_LIN_TXEMPTY(value)             (US_IDR_LIN_TXEMPTY_Msk & ((value) << US_IDR_LIN_TXEMPTY_Pos))
#define US_IDR_LIN_LINBK_Pos                  _U_(13)                                              /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Position */
#define US_IDR_LIN_LINBK_Msk                  (_U_(0x1) << US_IDR_LIN_LINBK_Pos)                   /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Mask */
#define US_IDR_LIN_LINBK(value)               (US_IDR_LIN_LINBK_Msk & ((value) << US_IDR_LIN_LINBK_Pos))
#define US_IDR_LIN_LINID_Pos                  _U_(14)                                              /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Position */
#define US_IDR_LIN_LINID_Msk                  (_U_(0x1) << US_IDR_LIN_LINID_Pos)                   /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Mask */
#define US_IDR_LIN_LINID(value)               (US_IDR_LIN_LINID_Msk & ((value) << US_IDR_LIN_LINID_Pos))
#define US_IDR_LIN_LINTC_Pos                  _U_(15)                                              /**< (US_IDR) LIN Transfer Completed Interrupt Disable Position */
#define US_IDR_LIN_LINTC_Msk                  (_U_(0x1) << US_IDR_LIN_LINTC_Pos)                   /**< (US_IDR) LIN Transfer Completed Interrupt Disable Mask */
#define US_IDR_LIN_LINTC(value)               (US_IDR_LIN_LINTC_Msk & ((value) << US_IDR_LIN_LINTC_Pos))
#define US_IDR_LIN_LINBE_Pos                  _U_(25)                                              /**< (US_IDR) LIN Bus Error Interrupt Disable Position */
#define US_IDR_LIN_LINBE_Msk                  (_U_(0x1) << US_IDR_LIN_LINBE_Pos)                   /**< (US_IDR) LIN Bus Error Interrupt Disable Mask */
#define US_IDR_LIN_LINBE(value)               (US_IDR_LIN_LINBE_Msk & ((value) << US_IDR_LIN_LINBE_Pos))
#define US_IDR_LIN_LINISFE_Pos                _U_(26)                                              /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Position */
#define US_IDR_LIN_LINISFE_Msk                (_U_(0x1) << US_IDR_LIN_LINISFE_Pos)                 /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Mask */
#define US_IDR_LIN_LINISFE(value)             (US_IDR_LIN_LINISFE_Msk & ((value) << US_IDR_LIN_LINISFE_Pos))
#define US_IDR_LIN_LINIPE_Pos                 _U_(27)                                              /**< (US_IDR) LIN Identifier Parity Interrupt Disable Position */
#define US_IDR_LIN_LINIPE_Msk                 (_U_(0x1) << US_IDR_LIN_LINIPE_Pos)                  /**< (US_IDR) LIN Identifier Parity Interrupt Disable Mask */
#define US_IDR_LIN_LINIPE(value)              (US_IDR_LIN_LINIPE_Msk & ((value) << US_IDR_LIN_LINIPE_Pos))
#define US_IDR_LIN_LINCE_Pos                  _U_(28)                                              /**< (US_IDR) LIN Checksum Error Interrupt Disable Position */
#define US_IDR_LIN_LINCE_Msk                  (_U_(0x1) << US_IDR_LIN_LINCE_Pos)                   /**< (US_IDR) LIN Checksum Error Interrupt Disable Mask */
#define US_IDR_LIN_LINCE(value)               (US_IDR_LIN_LINCE_Msk & ((value) << US_IDR_LIN_LINCE_Pos))
#define US_IDR_LIN_LINSNRE_Pos                _U_(29)                                              /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Position */
#define US_IDR_LIN_LINSNRE_Msk                (_U_(0x1) << US_IDR_LIN_LINSNRE_Pos)                 /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Mask */
#define US_IDR_LIN_LINSNRE(value)             (US_IDR_LIN_LINSNRE_Msk & ((value) << US_IDR_LIN_LINSNRE_Pos))
#define US_IDR_LIN_LINSTE_Pos                 _U_(30)                                              /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Position */
#define US_IDR_LIN_LINSTE_Msk                 (_U_(0x1) << US_IDR_LIN_LINSTE_Pos)                  /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Mask */
#define US_IDR_LIN_LINSTE(value)              (US_IDR_LIN_LINSTE_Msk & ((value) << US_IDR_LIN_LINSTE_Pos))
#define US_IDR_LIN_LINHTE_Pos                 _U_(31)                                              /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Position */
#define US_IDR_LIN_LINHTE_Msk                 (_U_(0x1) << US_IDR_LIN_LINHTE_Pos)                  /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Mask */
#define US_IDR_LIN_LINHTE(value)              (US_IDR_LIN_LINHTE_Msk & ((value) << US_IDR_LIN_LINHTE_Pos))
#define US_IDR_LIN_Msk                        _U_(0xFE00E3E3)                                       /**< (US_IDR_LIN) Register Mask  */

/* LON mode */
#define US_IDR_LON_RXRDY_Pos                  _U_(0)                                               /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_LON_RXRDY_Msk                  (_U_(0x1) << US_IDR_LON_RXRDY_Pos)                   /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_LON_RXRDY(value)               (US_IDR_LON_RXRDY_Msk & ((value) << US_IDR_LON_RXRDY_Pos))
#define US_IDR_LON_TXRDY_Pos                  _U_(1)                                               /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_LON_TXRDY_Msk                  (_U_(0x1) << US_IDR_LON_TXRDY_Pos)                   /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_LON_TXRDY(value)               (US_IDR_LON_TXRDY_Msk & ((value) << US_IDR_LON_TXRDY_Pos))
#define US_IDR_LON_OVRE_Pos                   _U_(5)                                               /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_LON_OVRE_Msk                   (_U_(0x1) << US_IDR_LON_OVRE_Pos)                    /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_LON_OVRE(value)                (US_IDR_LON_OVRE_Msk & ((value) << US_IDR_LON_OVRE_Pos))
#define US_IDR_LON_LSFE_Pos                   _U_(6)                                               /**< (US_IDR) LON Short Frame Error Interrupt Disable Position */
#define US_IDR_LON_LSFE_Msk                   (_U_(0x1) << US_IDR_LON_LSFE_Pos)                    /**< (US_IDR) LON Short Frame Error Interrupt Disable Mask */
#define US_IDR_LON_LSFE(value)                (US_IDR_LON_LSFE_Msk & ((value) << US_IDR_LON_LSFE_Pos))
#define US_IDR_LON_LCRCE_Pos                  _U_(7)                                               /**< (US_IDR) LON CRC Error Interrupt Disable Position */
#define US_IDR_LON_LCRCE_Msk                  (_U_(0x1) << US_IDR_LON_LCRCE_Pos)                   /**< (US_IDR) LON CRC Error Interrupt Disable Mask */
#define US_IDR_LON_LCRCE(value)               (US_IDR_LON_LCRCE_Msk & ((value) << US_IDR_LON_LCRCE_Pos))
#define US_IDR_LON_TXEMPTY_Pos                _U_(9)                                               /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_LON_TXEMPTY_Msk                (_U_(0x1) << US_IDR_LON_TXEMPTY_Pos)                 /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_LON_TXEMPTY(value)             (US_IDR_LON_TXEMPTY_Msk & ((value) << US_IDR_LON_TXEMPTY_Pos))
#define US_IDR_LON_UNRE_Pos                   _U_(10)                                              /**< (US_IDR) SPI Underrun Error Interrupt Disable Position */
#define US_IDR_LON_UNRE_Msk                   (_U_(0x1) << US_IDR_LON_UNRE_Pos)                    /**< (US_IDR) SPI Underrun Error Interrupt Disable Mask */
#define US_IDR_LON_UNRE(value)                (US_IDR_LON_UNRE_Msk & ((value) << US_IDR_LON_UNRE_Pos))
#define US_IDR_LON_LTXD_Pos                   _U_(24)                                              /**< (US_IDR) LON Transmission Done Interrupt Disable Position */
#define US_IDR_LON_LTXD_Msk                   (_U_(0x1) << US_IDR_LON_LTXD_Pos)                    /**< (US_IDR) LON Transmission Done Interrupt Disable Mask */
#define US_IDR_LON_LTXD(value)                (US_IDR_LON_LTXD_Msk & ((value) << US_IDR_LON_LTXD_Pos))
#define US_IDR_LON_LCOL_Pos                   _U_(25)                                              /**< (US_IDR) LON Collision Interrupt Disable Position */
#define US_IDR_LON_LCOL_Msk                   (_U_(0x1) << US_IDR_LON_LCOL_Pos)                    /**< (US_IDR) LON Collision Interrupt Disable Mask */
#define US_IDR_LON_LCOL(value)                (US_IDR_LON_LCOL_Msk & ((value) << US_IDR_LON_LCOL_Pos))
#define US_IDR_LON_LFET_Pos                   _U_(26)                                              /**< (US_IDR) LON Frame Early Termination Interrupt Disable Position */
#define US_IDR_LON_LFET_Msk                   (_U_(0x1) << US_IDR_LON_LFET_Pos)                    /**< (US_IDR) LON Frame Early Termination Interrupt Disable Mask */
#define US_IDR_LON_LFET(value)                (US_IDR_LON_LFET_Msk & ((value) << US_IDR_LON_LFET_Pos))
#define US_IDR_LON_LRXD_Pos                   _U_(27)                                              /**< (US_IDR) LON Reception Done Interrupt Disable Position */
#define US_IDR_LON_LRXD_Msk                   (_U_(0x1) << US_IDR_LON_LRXD_Pos)                    /**< (US_IDR) LON Reception Done Interrupt Disable Mask */
#define US_IDR_LON_LRXD(value)                (US_IDR_LON_LRXD_Msk & ((value) << US_IDR_LON_LRXD_Pos))
#define US_IDR_LON_LBLOVFE_Pos                _U_(28)                                              /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Position */
#define US_IDR_LON_LBLOVFE_Msk                (_U_(0x1) << US_IDR_LON_LBLOVFE_Pos)                 /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Mask */
#define US_IDR_LON_LBLOVFE(value)             (US_IDR_LON_LBLOVFE_Msk & ((value) << US_IDR_LON_LBLOVFE_Pos))
#define US_IDR_LON_Msk                        _U_(0x1F0006E3)                                       /**< (US_IDR_LON) Register Mask  */


/* -------- US_IMR : (USART Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define US_IMR_Msk                            _U_(0x00000000)                                      /**< (US_IMR) Register Mask  */

/* USART mode */
#define US_IMR_USART_RXRDY_Pos                _U_(0)                                               /**< (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_USART_RXRDY_Msk                (_U_(0x1) << US_IMR_USART_RXRDY_Pos)                 /**< (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_USART_RXRDY(value)             (US_IMR_USART_RXRDY_Msk & ((value) << US_IMR_USART_RXRDY_Pos))
#define US_IMR_USART_TXRDY_Pos                _U_(1)                                               /**< (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_USART_TXRDY_Msk                (_U_(0x1) << US_IMR_USART_TXRDY_Pos)                 /**< (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_USART_TXRDY(value)             (US_IMR_USART_TXRDY_Msk & ((value) << US_IMR_USART_TXRDY_Pos))
#define US_IMR_USART_RXBRK_Pos                _U_(2)                                               /**< (US_IMR) Receiver Break Interrupt Mask Position */
#define US_IMR_USART_RXBRK_Msk                (_U_(0x1) << US_IMR_USART_RXBRK_Pos)                 /**< (US_IMR) Receiver Break Interrupt Mask Mask */
#define US_IMR_USART_RXBRK(value)             (US_IMR_USART_RXBRK_Msk & ((value) << US_IMR_USART_RXBRK_Pos))
#define US_IMR_USART_OVRE_Pos                 _U_(5)                                               /**< (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_USART_OVRE_Msk                 (_U_(0x1) << US_IMR_USART_OVRE_Pos)                  /**< (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_USART_OVRE(value)              (US_IMR_USART_OVRE_Msk & ((value) << US_IMR_USART_OVRE_Pos))
#define US_IMR_USART_FRAME_Pos                _U_(6)                                               /**< (US_IMR) Framing Error Interrupt Mask Position */
#define US_IMR_USART_FRAME_Msk                (_U_(0x1) << US_IMR_USART_FRAME_Pos)                 /**< (US_IMR) Framing Error Interrupt Mask Mask */
#define US_IMR_USART_FRAME(value)             (US_IMR_USART_FRAME_Msk & ((value) << US_IMR_USART_FRAME_Pos))
#define US_IMR_USART_PARE_Pos                 _U_(7)                                               /**< (US_IMR) Parity Error Interrupt Mask Position */
#define US_IMR_USART_PARE_Msk                 (_U_(0x1) << US_IMR_USART_PARE_Pos)                  /**< (US_IMR) Parity Error Interrupt Mask Mask */
#define US_IMR_USART_PARE(value)              (US_IMR_USART_PARE_Msk & ((value) << US_IMR_USART_PARE_Pos))
#define US_IMR_USART_TIMEOUT_Pos              _U_(8)                                               /**< (US_IMR) Timeout Interrupt Mask Position */
#define US_IMR_USART_TIMEOUT_Msk              (_U_(0x1) << US_IMR_USART_TIMEOUT_Pos)               /**< (US_IMR) Timeout Interrupt Mask Mask */
#define US_IMR_USART_TIMEOUT(value)           (US_IMR_USART_TIMEOUT_Msk & ((value) << US_IMR_USART_TIMEOUT_Pos))
#define US_IMR_USART_TXEMPTY_Pos              _U_(9)                                               /**< (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_USART_TXEMPTY_Msk              (_U_(0x1) << US_IMR_USART_TXEMPTY_Pos)               /**< (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_USART_TXEMPTY(value)           (US_IMR_USART_TXEMPTY_Msk & ((value) << US_IMR_USART_TXEMPTY_Pos))
#define US_IMR_USART_ITER_Pos                 _U_(10)                                              /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Position */
#define US_IMR_USART_ITER_Msk                 (_U_(0x1) << US_IMR_USART_ITER_Pos)                  /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Mask */
#define US_IMR_USART_ITER(value)              (US_IMR_USART_ITER_Msk & ((value) << US_IMR_USART_ITER_Pos))
#define US_IMR_USART_NACK_Pos                 _U_(13)                                              /**< (US_IMR) Non Acknowledge Interrupt Mask Position */
#define US_IMR_USART_NACK_Msk                 (_U_(0x1) << US_IMR_USART_NACK_Pos)                  /**< (US_IMR) Non Acknowledge Interrupt Mask Mask */
#define US_IMR_USART_NACK(value)              (US_IMR_USART_NACK_Msk & ((value) << US_IMR_USART_NACK_Pos))
#define US_IMR_USART_RIIC_Pos                 _U_(16)                                              /**< (US_IMR) Ring Indicator Input Change Mask Position */
#define US_IMR_USART_RIIC_Msk                 (_U_(0x1) << US_IMR_USART_RIIC_Pos)                  /**< (US_IMR) Ring Indicator Input Change Mask Mask */
#define US_IMR_USART_RIIC(value)              (US_IMR_USART_RIIC_Msk & ((value) << US_IMR_USART_RIIC_Pos))
#define US_IMR_USART_DSRIC_Pos                _U_(17)                                              /**< (US_IMR) Data Set Ready Input Change Mask Position */
#define US_IMR_USART_DSRIC_Msk                (_U_(0x1) << US_IMR_USART_DSRIC_Pos)                 /**< (US_IMR) Data Set Ready Input Change Mask Mask */
#define US_IMR_USART_DSRIC(value)             (US_IMR_USART_DSRIC_Msk & ((value) << US_IMR_USART_DSRIC_Pos))
#define US_IMR_USART_DCDIC_Pos                _U_(18)                                              /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Position */
#define US_IMR_USART_DCDIC_Msk                (_U_(0x1) << US_IMR_USART_DCDIC_Pos)                 /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Mask */
#define US_IMR_USART_DCDIC(value)             (US_IMR_USART_DCDIC_Msk & ((value) << US_IMR_USART_DCDIC_Pos))
#define US_IMR_USART_CTSIC_Pos                _U_(19)                                              /**< (US_IMR) Clear to Send Input Change Interrupt Mask Position */
#define US_IMR_USART_CTSIC_Msk                (_U_(0x1) << US_IMR_USART_CTSIC_Pos)                 /**< (US_IMR) Clear to Send Input Change Interrupt Mask Mask */
#define US_IMR_USART_CTSIC(value)             (US_IMR_USART_CTSIC_Msk & ((value) << US_IMR_USART_CTSIC_Pos))
#define US_IMR_USART_MANE_Pos                 _U_(24)                                              /**< (US_IMR) Manchester Error Interrupt Mask Position */
#define US_IMR_USART_MANE_Msk                 (_U_(0x1) << US_IMR_USART_MANE_Pos)                  /**< (US_IMR) Manchester Error Interrupt Mask Mask */
#define US_IMR_USART_MANE(value)              (US_IMR_USART_MANE_Msk & ((value) << US_IMR_USART_MANE_Pos))
#define US_IMR_USART_Msk                      _U_(0x010F27E7)                                       /**< (US_IMR_USART) Register Mask  */

/* SPI mode */
#define US_IMR_SPI_RXRDY_Pos                  _U_(0)                                               /**< (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_SPI_RXRDY_Msk                  (_U_(0x1) << US_IMR_SPI_RXRDY_Pos)                   /**< (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_SPI_RXRDY(value)               (US_IMR_SPI_RXRDY_Msk & ((value) << US_IMR_SPI_RXRDY_Pos))
#define US_IMR_SPI_TXRDY_Pos                  _U_(1)                                               /**< (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_SPI_TXRDY_Msk                  (_U_(0x1) << US_IMR_SPI_TXRDY_Pos)                   /**< (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_SPI_TXRDY(value)               (US_IMR_SPI_TXRDY_Msk & ((value) << US_IMR_SPI_TXRDY_Pos))
#define US_IMR_SPI_OVRE_Pos                   _U_(5)                                               /**< (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_SPI_OVRE_Msk                   (_U_(0x1) << US_IMR_SPI_OVRE_Pos)                    /**< (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_SPI_OVRE(value)                (US_IMR_SPI_OVRE_Msk & ((value) << US_IMR_SPI_OVRE_Pos))
#define US_IMR_SPI_TXEMPTY_Pos                _U_(9)                                               /**< (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_SPI_TXEMPTY_Msk                (_U_(0x1) << US_IMR_SPI_TXEMPTY_Pos)                 /**< (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_SPI_TXEMPTY(value)             (US_IMR_SPI_TXEMPTY_Msk & ((value) << US_IMR_SPI_TXEMPTY_Pos))
#define US_IMR_SPI_UNRE_Pos                   _U_(10)                                              /**< (US_IMR) SPI Underrun Error Interrupt Mask Position */
#define US_IMR_SPI_UNRE_Msk                   (_U_(0x1) << US_IMR_SPI_UNRE_Pos)                    /**< (US_IMR) SPI Underrun Error Interrupt Mask Mask */
#define US_IMR_SPI_UNRE(value)                (US_IMR_SPI_UNRE_Msk & ((value) << US_IMR_SPI_UNRE_Pos))
#define US_IMR_SPI_NSSE_Pos                   _U_(19)                                              /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IMR_SPI_NSSE_Msk                   (_U_(0x1) << US_IMR_SPI_NSSE_Pos)                    /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IMR_SPI_NSSE(value)                (US_IMR_SPI_NSSE_Msk & ((value) << US_IMR_SPI_NSSE_Pos))
#define US_IMR_SPI_Msk                        _U_(0x00080623)                                       /**< (US_IMR_SPI) Register Mask  */

