Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/include/component/usart.h
/* -------- US_CSR : (USART Offset: 0x14) ( R/ 32) Channel Status Register -------- */
#define US_CSR_Msk                            _U_(0x00000000)                                      /**< (US_CSR) Register Mask  */

/* USART mode */
#define US_CSR_USART_RXRDY_Pos                _U_(0)                                               /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_USART_RXRDY_Msk                (_U_(0x1) << US_CSR_USART_RXRDY_Pos)                 /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_USART_RXRDY(value)             (US_CSR_USART_RXRDY_Msk & ((value) << US_CSR_USART_RXRDY_Pos))
#define US_CSR_USART_TXRDY_Pos                _U_(1)                                               /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_USART_TXRDY_Msk                (_U_(0x1) << US_CSR_USART_TXRDY_Pos)                 /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_USART_TXRDY(value)             (US_CSR_USART_TXRDY_Msk & ((value) << US_CSR_USART_TXRDY_Pos))
#define US_CSR_USART_RXBRK_Pos                _U_(2)                                               /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_USART_RXBRK_Msk                (_U_(0x1) << US_CSR_USART_RXBRK_Pos)                 /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_USART_RXBRK(value)             (US_CSR_USART_RXBRK_Msk & ((value) << US_CSR_USART_RXBRK_Pos))
#define US_CSR_USART_OVRE_Pos                 _U_(5)                                               /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_USART_OVRE_Msk                 (_U_(0x1) << US_CSR_USART_OVRE_Pos)                  /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_USART_OVRE(value)              (US_CSR_USART_OVRE_Msk & ((value) << US_CSR_USART_OVRE_Pos))
#define US_CSR_USART_FRAME_Pos                _U_(6)                                               /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_USART_FRAME_Msk                (_U_(0x1) << US_CSR_USART_FRAME_Pos)                 /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_USART_FRAME(value)             (US_CSR_USART_FRAME_Msk & ((value) << US_CSR_USART_FRAME_Pos))
#define US_CSR_USART_PARE_Pos                 _U_(7)                                               /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_USART_PARE_Msk                 (_U_(0x1) << US_CSR_USART_PARE_Pos)                  /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_USART_PARE(value)              (US_CSR_USART_PARE_Msk & ((value) << US_CSR_USART_PARE_Pos))
#define US_CSR_USART_TIMEOUT_Pos              _U_(8)                                               /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Position */
#define US_CSR_USART_TIMEOUT_Msk              (_U_(0x1) << US_CSR_USART_TIMEOUT_Pos)               /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Mask */
#define US_CSR_USART_TIMEOUT(value)           (US_CSR_USART_TIMEOUT_Msk & ((value) << US_CSR_USART_TIMEOUT_Pos))
#define US_CSR_USART_TXEMPTY_Pos              _U_(9)                                               /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_USART_TXEMPTY_Msk              (_U_(0x1) << US_CSR_USART_TXEMPTY_Pos)               /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_USART_TXEMPTY(value)           (US_CSR_USART_TXEMPTY_Msk & ((value) << US_CSR_USART_TXEMPTY_Pos))
#define US_CSR_USART_ITER_Pos                 _U_(10)                                              /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Position */
#define US_CSR_USART_ITER_Msk                 (_U_(0x1) << US_CSR_USART_ITER_Pos)                  /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Mask */
#define US_CSR_USART_ITER(value)              (US_CSR_USART_ITER_Msk & ((value) << US_CSR_USART_ITER_Pos))
#define US_CSR_USART_NACK_Pos                 _U_(13)                                              /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Position */
#define US_CSR_USART_NACK_Msk                 (_U_(0x1) << US_CSR_USART_NACK_Pos)                  /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Mask */
#define US_CSR_USART_NACK(value)              (US_CSR_USART_NACK_Msk & ((value) << US_CSR_USART_NACK_Pos))
#define US_CSR_USART_RIIC_Pos                 _U_(16)                                              /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Position */
#define US_CSR_USART_RIIC_Msk                 (_U_(0x1) << US_CSR_USART_RIIC_Pos)                  /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Mask */
#define US_CSR_USART_RIIC(value)              (US_CSR_USART_RIIC_Msk & ((value) << US_CSR_USART_RIIC_Pos))
#define US_CSR_USART_DSRIC_Pos                _U_(17)                                              /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Position */
#define US_CSR_USART_DSRIC_Msk                (_U_(0x1) << US_CSR_USART_DSRIC_Pos)                 /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Mask */
#define US_CSR_USART_DSRIC(value)             (US_CSR_USART_DSRIC_Msk & ((value) << US_CSR_USART_DSRIC_Pos))
#define US_CSR_USART_DCDIC_Pos                _U_(18)                                              /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Position */
#define US_CSR_USART_DCDIC_Msk                (_U_(0x1) << US_CSR_USART_DCDIC_Pos)                 /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Mask */
#define US_CSR_USART_DCDIC(value)             (US_CSR_USART_DCDIC_Msk & ((value) << US_CSR_USART_DCDIC_Pos))
#define US_CSR_USART_CTSIC_Pos                _U_(19)                                              /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Position */
#define US_CSR_USART_CTSIC_Msk                (_U_(0x1) << US_CSR_USART_CTSIC_Pos)                 /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Mask */
#define US_CSR_USART_CTSIC(value)             (US_CSR_USART_CTSIC_Msk & ((value) << US_CSR_USART_CTSIC_Pos))
#define US_CSR_USART_RI_Pos                   _U_(20)                                              /**< (US_CSR) Image of RI Input Position */
#define US_CSR_USART_RI_Msk                   (_U_(0x1) << US_CSR_USART_RI_Pos)                    /**< (US_CSR) Image of RI Input Mask */
#define US_CSR_USART_RI(value)                (US_CSR_USART_RI_Msk & ((value) << US_CSR_USART_RI_Pos))
#define US_CSR_USART_DSR_Pos                  _U_(21)                                              /**< (US_CSR) Image of DSR Input Position */
#define US_CSR_USART_DSR_Msk                  (_U_(0x1) << US_CSR_USART_DSR_Pos)                   /**< (US_CSR) Image of DSR Input Mask */
#define US_CSR_USART_DSR(value)               (US_CSR_USART_DSR_Msk & ((value) << US_CSR_USART_DSR_Pos))
#define US_CSR_USART_DCD_Pos                  _U_(22)                                              /**< (US_CSR) Image of DCD Input Position */
#define US_CSR_USART_DCD_Msk                  (_U_(0x1) << US_CSR_USART_DCD_Pos)                   /**< (US_CSR) Image of DCD Input Mask */
#define US_CSR_USART_DCD(value)               (US_CSR_USART_DCD_Msk & ((value) << US_CSR_USART_DCD_Pos))
#define US_CSR_USART_CTS_Pos                  _U_(23)                                              /**< (US_CSR) Image of CTS Input Position */
#define US_CSR_USART_CTS_Msk                  (_U_(0x1) << US_CSR_USART_CTS_Pos)                   /**< (US_CSR) Image of CTS Input Mask */
#define US_CSR_USART_CTS(value)               (US_CSR_USART_CTS_Msk & ((value) << US_CSR_USART_CTS_Pos))
#define US_CSR_USART_MANERR_Pos               _U_(24)                                              /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_USART_MANERR_Msk               (_U_(0x1) << US_CSR_USART_MANERR_Pos)                /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
#define US_CSR_USART_MANERR(value)            (US_CSR_USART_MANERR_Msk & ((value) << US_CSR_USART_MANERR_Pos))
#define US_CSR_USART_Msk                      _U_(0x01FF27E7)                                       /**< (US_CSR_USART) Register Mask  */

/* SPI mode */
#define US_CSR_SPI_RXRDY_Pos                  _U_(0)                                               /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_SPI_RXRDY_Msk                  (_U_(0x1) << US_CSR_SPI_RXRDY_Pos)                   /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_SPI_RXRDY(value)               (US_CSR_SPI_RXRDY_Msk & ((value) << US_CSR_SPI_RXRDY_Pos))
#define US_CSR_SPI_TXRDY_Pos                  _U_(1)                                               /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_SPI_TXRDY_Msk                  (_U_(0x1) << US_CSR_SPI_TXRDY_Pos)                   /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_SPI_TXRDY(value)               (US_CSR_SPI_TXRDY_Msk & ((value) << US_CSR_SPI_TXRDY_Pos))
#define US_CSR_SPI_OVRE_Pos                   _U_(5)                                               /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_SPI_OVRE_Msk                   (_U_(0x1) << US_CSR_SPI_OVRE_Pos)                    /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_SPI_OVRE(value)                (US_CSR_SPI_OVRE_Msk & ((value) << US_CSR_SPI_OVRE_Pos))
#define US_CSR_SPI_TXEMPTY_Pos                _U_(9)                                               /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_SPI_TXEMPTY_Msk                (_U_(0x1) << US_CSR_SPI_TXEMPTY_Pos)                 /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_SPI_TXEMPTY(value)             (US_CSR_SPI_TXEMPTY_Msk & ((value) << US_CSR_SPI_TXEMPTY_Pos))
#define US_CSR_SPI_UNRE_Pos                   _U_(10)                                              /**< (US_CSR) SPI Underrun Error Position */
#define US_CSR_SPI_UNRE_Msk                   (_U_(0x1) << US_CSR_SPI_UNRE_Pos)                    /**< (US_CSR) SPI Underrun Error Mask */
#define US_CSR_SPI_UNRE(value)                (US_CSR_SPI_UNRE_Msk & ((value) << US_CSR_SPI_UNRE_Pos))
#define US_CSR_SPI_NSSE_Pos                   _U_(19)                                              /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_CSR_SPI_NSSE_Msk                   (_U_(0x1) << US_CSR_SPI_NSSE_Pos)                    /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_CSR_SPI_NSSE(value)                (US_CSR_SPI_NSSE_Msk & ((value) << US_CSR_SPI_NSSE_Pos))
#define US_CSR_SPI_NSS_Pos                    _U_(23)                                              /**< (US_CSR) Image of NSS Line Position */
#define US_CSR_SPI_NSS_Msk                    (_U_(0x1) << US_CSR_SPI_NSS_Pos)                     /**< (US_CSR) Image of NSS Line Mask */
#define US_CSR_SPI_NSS(value)                 (US_CSR_SPI_NSS_Msk & ((value) << US_CSR_SPI_NSS_Pos))
#define US_CSR_SPI_Msk                        _U_(0x00880623)                                       /**< (US_CSR_SPI) Register Mask  */

